artillery.yml
config:
  target: 'http://localhost:3009'
  phases:
    # - duration: 120
    #   arrivalCount: 12000
    #   name: "Warm up test"
    - duration: 300
      arrivalCount: 30000
      name: "Sustain max load test"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/api/photos/9576132"
    - get:
        url: "/api/photos/9142621"
    - get:
        url: "/api/photos/9867867"
    - get:
        url: "/api/photos/9998778"
    - get:
        url: "/api/photos/9095401"
    - get:
        url: "/api/photos/9136632"
    - get:
        url: "/api/photos/9663924"
    - get:
        url: "/api/photos/9998195"
    - get:
        url: "/api/photos/9012904"
    - get:
        url: "/api/photos/9825278"